#include <stdio.h>
#include<stdbool.h>			                // у stdbool міститься визначення логічних констант true та false
  bool isPrime(int x)		              	// перевіряє чи х просте число 
    {
    if (x>1)			                     	// якщо n > 1
    {
        for (int i = 2; i < x; i++)    	// у циклі перебираємо числа від 2 до n - 1
        if (x % i == 0)		             	// якщо n ділиться без остачі на i - повертаємо false (число не просте) 
        return false;
       
        return true;		               	// якщо дійшло до даного оператора повертаємо true (число просте)
    }
    else{				                        // інакше повертаємо false
    return false;
    }
 
 }
 int main()
 {
     int x;				    // задаємо змінну х
     printf("введіть число:");              // команда для виведення запиту числа
     scanf("%d",&x);                        // команда для введення значення х
     printf("значення:%d\n",isPrime(x));    // команда для виведення результату значення
 }

#include <stdio.h>
#include<stdbool.h>	                        // у stdbool міститься визначення логічних констант true та false
  bool isPrime(int x)                      	// перевіряє чи х просте число 
    {
    if (x>1)                                // якщо n > 1
    {
        int i = 2;                          // у циклі перебираємо числа від 2 до n - 1
        do
        { 
        if (x % i == 0)                     // якщо n ділиться без остачі на i - повертаємо false (число не просте) 
        return false;                      
        
        return true;                      	// якщо дійшло до даного оператора повертаємо true (число просте)
        i++;                                //збільшуємо число на 1
        }
        while ( i < x);                     //доки n > i
    }
    else{
    return false;                           // інакше повертаємо false
    }
  
 }
 int main()
 {
     int x;
     printf("введіть число:");              // команда для виведення запиту числа 
     scanf("%d",&x);                        // команда для введення значення х
     printf("значення:%d\n",isPrime(x));    // команда для виведення результату значення 
 }
#include <stdio.h>
#include<stdbool.h>                     // у stdbool міститься визначення логічних констант true та false
  bool isPrime(int x)                 	// перевіряє чи х просте число 
    {
    if (x>1)                            // якщо n > 1
    {
        int i = 2;                      // у циклі перебираємо числа від 2 до n - 1
        while ( i < x){                 //доки n > i
        if (x % i == 0)                 // якщо n ділиться без остачі на i - повертаємо false (число не просте) 
        return false; 
        
        return true;                    // якщо дійшло до даного оператора повертаємо true (число просте)
        i++;                            //збільшуємо число на 1
        }
    }
    else{                              
    return false;                       // інакше повертаємо false
    }
  
 }
 int main()
 {
     int x;
     printf("введіть число:");              // команда для виведення запиту числа 
     scanf("%d",&x);                        // команда для введення значення х
     printf("значення:%d\n",isPrime(x));    // команда для виведення результату значення 
 }
